{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"content:0": {"name": "content:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "iters:0": {"name": "iters:0", "dtype": "DT_INT32", "tensorShape": {}}, "max_resolution:0": {"name": "max_resolution:0", "dtype": "DT_INT32", "tensorShape": {}}, "style:0": {"name": "style:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"result": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/resize_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_37", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_47", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_49", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_50", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_51", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_52", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_55", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_56", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_57", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_58", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_59", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_60", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_61", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "64"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_62", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/strided_slice_5/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_5/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/floordiv/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/floordiv_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "content", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "iters", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_INT32"}}}, {"name": "max_resolution", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_INT32"}}}, {"name": "style", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/while/enter/_110", "op": "Enter", "input": ["unknown_31"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_111", "op": "Enter", "input": ["unknown_32"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_106", "op": "Enter", "input": ["unknown_27"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_107", "op": "Enter", "input": ["unknown_28"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_108", "op": "Enter", "input": ["unknown_29"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_109", "op": "Enter", "input": ["unknown_30"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_112", "op": "Enter", "input": ["unknown_33"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_113", "op": "Enter", "input": ["unknown_34"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_118", "op": "Enter", "input": ["unknown_39"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_119", "op": "Enter", "input": ["unknown_40"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_114", "op": "Enter", "input": ["unknown_35"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_115", "op": "Enter", "input": ["unknown_36"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_116", "op": "Enter", "input": ["unknown_37"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_117", "op": "Enter", "input": ["unknown_38"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_120", "op": "Enter", "input": ["unknown_41"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_121", "op": "Enter", "input": ["unknown_42"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_77", "op": "Enter", "input": ["unknown"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_78", "op": "Enter", "input": ["unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_79", "op": "Enter", "input": ["unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_80", "op": "Enter", "input": ["unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_81", "op": "Enter", "input": ["unknown_3"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_82", "op": "Enter", "input": ["unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_83", "op": "Enter", "input": ["unknown_5"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_84", "op": "Enter", "input": ["unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_85", "op": "Enter", "input": ["unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_86", "op": "Enter", "input": ["unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_87", "op": "Enter", "input": ["unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_88", "op": "Enter", "input": ["unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_89", "op": "Enter", "input": ["unknown_11"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_90", "op": "Enter", "input": ["unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_91", "op": "Enter", "input": ["unknown_13"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_92", "op": "Enter", "input": ["unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_93", "op": "Enter", "input": ["unknown_15"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_94", "op": "Enter", "input": ["unknown_16"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_95", "op": "Enter", "input": ["unknown_17"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_96", "op": "Enter", "input": ["unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_97", "op": "Enter", "input": ["unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_98", "op": "Enter", "input": ["unknown_20"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_99", "op": "Enter", "input": ["unknown_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_100", "op": "Enter", "input": ["unknown_22"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_101", "op": "Enter", "input": ["unknown_23"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_102", "op": "Enter", "input": ["unknown_24"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_103", "op": "Enter", "input": ["unknown_25"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_104", "op": "Enter", "input": ["unknown_26"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_122", "op": "Enter", "input": ["unknown_43"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_123", "op": "Enter", "input": ["unknown_44"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_124", "op": "Enter", "input": ["unknown_45"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_125", "op": "Enter", "input": ["unknown_46"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_126", "op": "Enter", "input": ["unknown_47"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_127", "op": "Enter", "input": ["unknown_48"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_128", "op": "Enter", "input": ["unknown_49"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_129", "op": "Enter", "input": ["unknown_50"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_130", "op": "Enter", "input": ["unknown_51"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_131", "op": "Enter", "input": ["unknown_52"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_132", "op": "Enter", "input": ["unknown_53"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_133", "op": "Enter", "input": ["unknown_54"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_134", "op": "Enter", "input": ["unknown_55"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_135", "op": "Enter", "input": ["unknown_56"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_136", "op": "Enter", "input": ["unknown_57"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_137", "op": "Enter", "input": ["unknown_58"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_138", "op": "Enter", "input": ["unknown_59"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_139", "op": "Enter", "input": ["unknown_60"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_140", "op": "Enter", "input": ["unknown_61"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_141", "op": "Enter", "input": ["unknown_62"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_75", "op": "Enter", "input": ["StatefulPartitionedCall/Const"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/Shape", "op": "Shape", "input": ["content"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize/ExpandDims", "op": "ExpandDims", "input": ["content", "StatefulPartitionedCall/resize/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/while/enter/_76", "op": "Enter", "input": ["iters"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "10"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/floordiv", "op": "FloorDiv", "input": ["max_resolution", "StatefulPartitionedCall/floordiv/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resize_2/ExpandDims", "op": "ExpandDims", "input": ["style", "StatefulPartitionedCall/resize_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/while/merge/_180", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_110", "StatefulPartitionedCall/while/next_iteration/_393"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_181", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_111", "StatefulPartitionedCall/while/next_iteration/_394"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_176", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_106", "StatefulPartitionedCall/while/next_iteration/_389"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_177", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_107", "StatefulPartitionedCall/while/next_iteration/_390"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_178", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_108", "StatefulPartitionedCall/while/next_iteration/_391"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_179", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_109", "StatefulPartitionedCall/while/next_iteration/_392"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_182", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_112", "StatefulPartitionedCall/while/next_iteration/_395"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_183", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_113", "StatefulPartitionedCall/while/next_iteration/_396"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_188", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_118", "StatefulPartitionedCall/while/next_iteration/_401"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_189", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_119", "StatefulPartitionedCall/while/next_iteration/_402"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_184", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_114", "StatefulPartitionedCall/while/next_iteration/_397"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_185", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_115", "StatefulPartitionedCall/while/next_iteration/_398"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_186", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_116", "StatefulPartitionedCall/while/next_iteration/_399"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_187", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_117", "StatefulPartitionedCall/while/next_iteration/_400"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_190", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_120", "StatefulPartitionedCall/while/next_iteration/_403"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_191", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_121", "StatefulPartitionedCall/while/next_iteration/_404"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_147", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_77", "StatefulPartitionedCall/while/next_iteration/_360"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_148", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_78", "StatefulPartitionedCall/while/next_iteration/_361"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_149", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_79", "StatefulPartitionedCall/while/next_iteration/_362"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_150", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_80", "StatefulPartitionedCall/while/next_iteration/_363"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_151", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_81", "StatefulPartitionedCall/while/next_iteration/_364"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_152", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_82", "StatefulPartitionedCall/while/next_iteration/_365"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_153", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_83", "StatefulPartitionedCall/while/next_iteration/_366"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_154", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_84", "StatefulPartitionedCall/while/next_iteration/_367"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_155", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_85", "StatefulPartitionedCall/while/next_iteration/_368"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_156", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_86", "StatefulPartitionedCall/while/next_iteration/_369"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_157", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_87", "StatefulPartitionedCall/while/next_iteration/_370"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_158", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_88", "StatefulPartitionedCall/while/next_iteration/_371"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_159", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_89", "StatefulPartitionedCall/while/next_iteration/_372"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_160", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_90", "StatefulPartitionedCall/while/next_iteration/_373"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_161", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_91", "StatefulPartitionedCall/while/next_iteration/_374"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_162", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_92", "StatefulPartitionedCall/while/next_iteration/_375"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_163", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_93", "StatefulPartitionedCall/while/next_iteration/_376"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_164", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_94", "StatefulPartitionedCall/while/next_iteration/_377"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_165", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_95", "StatefulPartitionedCall/while/next_iteration/_378"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_166", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_96", "StatefulPartitionedCall/while/next_iteration/_379"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_167", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_97", "StatefulPartitionedCall/while/next_iteration/_380"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_168", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_98", "StatefulPartitionedCall/while/next_iteration/_381"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_169", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_99", "StatefulPartitionedCall/while/next_iteration/_382"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_170", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_100", "StatefulPartitionedCall/while/next_iteration/_383"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_171", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_101", "StatefulPartitionedCall/while/next_iteration/_384"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/while/merge/_172", "op": "Merge", "input": ["StatefulPartitionedCall/while/enter/_102", 